Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: The findIndex(ofString:in:) function can be used to find a string value in an array of strings:
ja: findIndex(ofString:in:)関数は、文字列の配列の中をある文字列値がないか捜すために使われることができます：

source: The for-in loop is described in For-In Loops.
ja: for-inループはfor-inループで記述されます。

source: The gameDidStart(_:) method also accesses the dice property of the passed game parameter.
ja: gameDidStart(_:)メソッドはまた、渡されたgameパラメータのdiceプロパティにアクセスします。

source: The generator property is of type RandomNumberGenerator.
ja: generatorプロパティは、型RandomNumberGeneratorのものです。

source: The hasPrefix(_:) and hasSuffix(_:) methods perform a character-by-character canonical equivalence comparison between the extended grapheme clusters in each string, as described in String and Character Equality.
ja: hasPrefix(_:)とhasSuffix(_:)は、各文字列の拡張書記素クラスタ間で文字ごとの正準等価比較を実行します、そのことは文字列と文字の同等性で記述されます。

source: The height and width properties get their initial values from the definition of TwelveOrLess, which sets TwelveOrLess.number to zero.
ja: heightとwidthプロパティは、それらの初期値をTwelveOrLessの定義から取得します、それはTwelveOrLess.numberをゼロに設定します。

source: The if statement can provide an alternative set of statements, known as an else clause, for situations when the if condition is false.
ja: if文は、代替のひとそろいの文、else節として知られるものをif条件がfalseの場合の状況のために提供することができます。

source: The in keyword can also be omitted, because the closure expression is made up entirely of its body:
ja: inキーワードもまた、クロージャ式がもっぱらその本文から成り立つので、省略されることができます：

source: The increment() method first tries to retrieve an increment amount by looking for an implementation of the increment(forCount:) method on its data source.
ja: increment()メソッドは、最初にそれのデータ・ソース上でincrement(forCount:)メソッドの実装を捜すことによって増加量を取り出そうと試みます。

source: The increment() method in the example above could have been written like this:
ja: 上の例におけるincrement()メソッドは、このように記述されることができます：

source: The incrementer() function doesn’t have any parameters, and yet it refers to runningTotal and amount from within its function body.
ja: incrementer()関数には全くパラメータがありません、それなのに、それはその関数本文内からrunningTotalとamountに言及します。

source: The init() initializer for Bicycle starts by calling super.init(), which calls the default initializer for the Bicycle class’s superclass, Vehicle.
ja: Bicycleのためのinit()イニシャライザは、super.init()を呼ぶことによって始まります、それは、Bicycleクラスのスーパークラス、Vehicleのための省略時のイニシャライザを呼び出します。

source: The init(center:size:) initializer could have assigned the new values of origin and size to the appropriate properties itself.
ja: init(center:size:)イニシャライザは、それ自体でoriginとsizeの新しい値を適切なプロパティに代入することができました。

source: The init(name: String) convenience initializer provided by RecipeIngredient takes the same parameters as the init(name: String) designated initializer from Food.
ja: RecipeIngredientによって提供される便宜イニシャライザinit(name: String)は、Foodからの指定イニシャライザinit(name: String)と同じパラメータを取ります。

source: The init(name: String) initializer from the Food class is provided as a designated initializer, because it ensures that all stored properties of a new Food instance are fully initialized.
ja: init(name: String)イニシャライザは、このFoodクラス由来で、指定イニシャライザとして提供されます、なぜならそれは新しいFoodインスタンスのすべての格納プロパティが完全に初期化されるのを確実にするからです。

source: The introduced argument indicates the first version of the specified platform or language in which the declaration was introduced.
ja: introduced引数は、そこにおいてその宣言が導入されたところの、指定されたプラットホームまたは言語の最初のバージョンを指し示します。

source: The is operator checks at runtime whether the expression can be cast to the specified type.
ja: is演算子は実行時に式が指定された型へとキャスト可能かどうかを調べます。

source: The is operator returns true if an instance conforms to a protocol and returns false if it doesn’t.
ja: is演算子は、あるインスタンスがプロトコルに準拠するならばtrueを返して、それがそうしないならばfalseを返します。

source: The is pattern matches a value if the type of that value at runtime is the same as the type specified in the right-hand side of the is pattern—or a subclass of that type.
ja: isパターンは、ある値にマッチします、もしその値の実行時での型がisパターンの右側で指定される型 ― またはそれの型のサブクラス ― と同じものであるならば。

source: The john variable now has a strong reference to the new Person instance, and the unit4A variable has a strong reference to the new Apartment instance:
ja: john変数は現在新しいPersonインスタンスへの強い参照を持ちます、そしてunit4A変数は新しいApartmentインスタンスへの強い参照を持ちます：

source: The makeIncrementer(forIncrement:) function defines an integer variable called runningTotal, to store the current running total of the incrementer that will be returned.
ja: makeIncrementer(forIncrement:)関数は、返されるincrementerの現時点での合計を格納するために、runningTotalと呼ばれる整数変数を定義します。

source: The makeIncrementer(forIncrement:) function has a single Int parameter with an argument label of forIncrement, and a parameter name of amount.
ja: makeIncrementer(forIncrement:)関数は、forIncrementの引数ラベル、そしてamountのパラメータ名を持つ、ただ１つのIntパラメータを持ちます。

source: The makeIterator() method is called on the collection expression to obtain a value of an iterator type—that is, a type that conforms to the IteratorProtocol [https://developer.apple.com/documentation/swift/iteratorprotocol] protocol.
ja: makeIterator()メソッドがcollection（コレクション）式の上で呼ばれて、イテレータ型 ― すなわち、IteratorProtocol [https://developer.apple.com/documentation/swift/iteratorprotocol]プロトコルに準拠する型、に属する１つの値を取得します。

source: The makeTrapezoid() function in this example declares its return type as some Shape; as a result, the function returns a value of some given type that conforms to the Shape protocol, without specifying any particular concrete type.
ja: この例でのmakeTrapezoid()関数は、それの戻り型をsome Shapeとして宣言します；その結果、関数は、Shapeプロトコルに準拠するある与えられた型の値を返します、何らかの特定の具象型を指定することなしに。

source: The map(_:) method calls the closure expression once for each item in the array.
ja: map(_:)メソッドは、配列の中の各項目に対して一度だけクロージャ式を呼びます。

source: The message argument provides a textual message that the compiler displays when emitting a warning or error about the use of a deprecated or obsoleted declaration.
ja: message引数は、あるテキストメッセージを提供します、それはコンパイラが非推奨または廃止された宣言の使用についての警告またはエラーを発するときに表示するものです。

source: The minMax(array:) function above returns a tuple containing two Int values.
ja: 上のminMax(array:)関数は、２つのInt値を含んでいるタプルを返します。

source: The minMax(array:) function returns a tuple containing two Int values.
ja: minMax(array:)関数は、２つのInt値を含んでいる１つのタプルを返します。

source: The number property of the CreditCard class is defined with a type of UInt64 rather than Int, to ensure that the number property’s capacity is large enough to store a 16-digit card number on both 32-bit and 64-bit systems.
ja: CreditCardクラスのnumberプロパティは、UInt64の型で定義されます、Intではなく、それによってnumberプロパティの容量が32bitと64bitシステムの両方で16桁のカード番号を格納するのに十分に大きいことを保証します。

source: The number variable is then divided by 10.
ja: number変数は、それから10で割られます。

source: The objc attribute is also implicitly added in the following cases:
ja: objc属性はまた、以下の場合において暗黙的に加えられます：

source: The objc attribute optionally accepts a single attribute argument, which consists of an identifier.
ja: objc属性は、任意にただ１つだけ属性引数を受け入れます、それはひとつの識別子から成ります。

source: The objc attribute tells the compiler that a declaration is available to use in Objective-C code.
ja: objc属性は、コンパイラにある宣言がObjective-Cコードにおいて使われることが可能であるのを伝えます。

source: The objects array can now be iterated, and each object in the array can be checked to see if it conforms to the HasArea protocol:
ja: objects配列は、今や繰り返されることができます、そして配列の各オブジェクトはそれがHasAreaプロトコルに従うかどうかを確認されることができます：

source: The objects array is initialized with an array literal containing a Circle instance with a radius of 2 units; a Country instance initialized with the surface area of the United Kingdom in square kilometers; and an Animal instance with four legs.
ja: objects配列は、単位２の半径をもつCircleインスタンスを含んでいる配列リテラル；平方キロメートルでの英国の面積で初期化されるCountryインスタンス；そして、４本脚のAnimalインスタンス；を含んでいる配列リテラルで初期化されます。

source: The obsoleted argument indicates the first version of the specified platform or language in which the declaration was obsoleted.
ja: obsoleted引数は、そこにおいてその宣言が廃止とされたところの、指定されたプラットホームまたは言語の最初のバージョンを指し示します。

source: The override keyword also prompts the Swift compiler to check that your overriding class’s superclass (or one of its parents) has a declaration that matches the one you provided for the override.
ja: overrideキーワードはまた、あなたのオーバーライドしているクラスのスーパークラス（またはその親のうちの１つ）が、そのオーバーライドのためにあなたが提供するものと合致する宣言を持っていることを確認するように、スウィフトのコンパイラを促します。

source: The paragraph variable above is defined as an optional HTMLElement, so that it can be set to nil below to demonstrate the presence of a strong reference cycle.
ja: 上記のparagraph変数は、オプショナルのHTMLElementとして定義されます、それでそれは下で強い参照循環の存在を例示するためにnilに設定されることができます。

source: The prettyTextualDescription property can now be used to print a pretty text description of any SnakesAndLadders instance:
ja: このprettyTextualDescriptionプロパティは、現在あらゆるSnakesAndLaddersインスタンスのきれいなテキスト解説を出力するために使われることができます：

source: The print(_:separator:terminator:) function doesn’t have a label for its first argument, and its other arguments are optional because they have a default value.
ja: print(_:separator:terminator:)関数は、それの最初の引数に対してラベルを持ちません、そしてそれの他の引数は任意です、それらが省略時の値を持つからです。

source: The print(_:separator:terminator:) function is a global function that prints one or more values to an appropriate output.
ja: print(_:separator:terminator:)関数は、ひとつ以上の値を適切な出力先に出力するグローバルな関数です。

source: The printNumberOfRooms() method on the Residence class prints the current value of numberOfRooms.
ja: Residenceクラス上のprintNumberOfRooms()メソッドは、numberOfRoomsの現在の値を出力します。

source: The receive(coins:) method simply adds the received number of coins back into the bank’s coin store.
ja: receive(coins:)メソッドは、単純に受け取ったコインの数を胴元のコインの蓄えに戻すよう加えます。

source: The renamed argument provides a textual message that indicates the new name for a declaration that’s been renamed.
ja: renamed引数は、あるテキストメッセージを提供します、それは改名された宣言に対する新しい名前を指し示すものです。

source: The repeat-while loop in Swift is analogous to a do-while loop in other languages.
ja: スウィフトのrepeat-whileループは、他の言語のdo-whileループと類似したものです。

source: The repetitions(task:) method takes a single argument of type () -> Void, which indicates a function that has no parameters and does not return a value.
ja: repetitions(task:)メソッドは型() -> Voidの引数をひとつだけとります、それは、パラメータを持たず、値を返さない関数であることを示します。

source: The self expression is an explicit reference to the current type or instance of the type in which it occurs.
ja: self式は、それがその中に現れているところの現在の型や型のインスタンスへの明確な参照です。

source: The self expression is used to specify scope when accessing members, providing disambiguation when there is another variable of the same name in scope, such as a function parameter.
ja: self式は、メンバーにアクセスする時にスコープを指定するために使われて、関数パラメータなど、同じ名前の別の変数がスコープ内にある場合に一義化を提供します。

source: The serve(customer:) function in the listing above takes an explicit closure that returns a customer’s name.
ja: 上で記載されるserve(customer:)関数は、次の顧客の名前を返す、ある明示的なクロージャを取ります。

source: The shoppingList array is declared as a variable (with the var introducer) and not a constant (with the let introducer) because more items are added to the shopping list in the examples below.
ja: shoppingList配列は、変数として（var導入子を使って）宣言されます、定数（let導入子を使って）ではなく、なぜならより多くの項目が下記の例で購入品目リストに加えられるからです。

source: The shoppingList variable is declared as “an array of string values”, written as [String].
ja: shoppingList変数は、「String値の配列」として宣言され、[String]のように書かれます。

source: The someFunctionWithEscapingClosure(_:) function takes a closure as its argument and adds it to an array that’s declared outside the function.
ja: someFunctionWithEscapingClosure(_:)関数は、クロージャをそれの引数として取ります、そしてそれを関数の外側で宣言される配列に加えます。

source: The sorted(by:) method accepts a closure that takes two arguments of the same type as the array’s contents, and returns a Bool value to say whether the first value should appear before or after the second value once the values are sorted.
ja: sorted(by:)メソッドは、配列の内容物と同じ型の２つの引数をとり、そしてひとたび値が分類されるならば最初の値が第２の値の前か後のどちらに現れなければならないのかを伝えるBool値を返すクロージャを受け取ります。

source: The sorted(by:) method is being called on an array of strings, so its argument must be a function of type (String, String) -> Bool.
ja: このsorted(by:)メソッドは文字列の配列上で呼ばれています、それでそれの引数は型(String, String) -> Boolの関数でなければなりません。

source: The square variable’s center property is then accessed through dot syntax (square.center), which causes the getter for center to be called, to retrieve the current property value.
ja: square変数のcenterプロパティは、それからドット構文（square.center）を通してアクセスされます、それによってcenterのためのゲッターが呼び出されて、現在のプロパティ値を取り出すことになります。

source: The startsWith(_:) method first makes sure that the container has at least one item, and then it checks whether the first item in the container matches the given item.
ja: startsWith(_:)メソッドはまず、コンテナが少なくとも１つの項目を持つことを確かめます、それからそれはそのコンテナの最初の項目が与えられた項目と合致するかどうか調べます。

source: The subscript(dynamicMemberLookup:) subscript enables syntactic sugar for member lookup, as described in dynamicMemberLookup.
ja: subscript(dynamicMemberLookup:)添え字は、メンバー検索に対する構文糖を可能にします、dynamicMemberLookupで記述されるように。

source: The swapTwoInts(_:_:) function is useful, but it can only be used with Int values.
ja: swapTwoInts(_:_:)関数は役に立ちます、しかし、それはInt値で使われることができるだけです。

source: The swapTwoInts(_:_:) function simply swaps the value of b into a, and the value of a into b.
ja: swapTwoInts(_:_:)関数は、単にbの値をaの中に、そしてaの値をbの中へと入れ替えます。

source: The swapTwoInts(_:_:) function swaps the original value of b into a, and the original value of a into b.
ja: swapTwoInts(_:_:)関数は、bの元々の値をaの中へ、そしてaの元々の値をbの中へと交換します、そして、最初の値のにb。

source: The swapTwoInts example above does not define a return type or return a value, but it still modifies the values of someInt and anotherInt.
ja: 上のswapTwoInts例は、戻り型を定義しないし、また値を返しません、しかしそれでもそれはsomeIntとanotherIntの値を修正します。

source: The swapTwoValues(_:_:) function and the Stack type can work with any type.
ja: swapTwoValues(_:_:)関数とStack型は、どんな型でも扱うことができます。

source: The swapTwoValues(_:_:) function can now be called in the same way as swapTwoInts, except that it can be passed two values of any type, as long as both of those values are of the same type as each other.
ja: swapTwoValues(_:_:)関数は現在swapTwoIntsと同じやり方で呼ばれることができます、しかしそれがあらゆる型の２つの値を渡されることが、それらの値の両方が互いに同じ型である限り可能であるのを除きます。

source: The swapTwoValues(_:_:) function defined above is inspired by a generic function called swap, which is part of the Swift standard library, and is automatically made available for you to use in your apps.
ja: 上で定義されるswapTwoValues(_:_:)関数はswapと呼ばれる総称体関数に着想を得たものです、それは、スウィフト標準ライブラリの一部であって、あなたのアプリにおいて自動的にあなたが使うことが可能にされます。

source: The swift argument indicates a Swift function reference.
ja: swift引数はあるスウィフト関数参照を指し示します。

source: The switch statement determines whether the point is at the origin (0, 0), on the red x-axis, on the orange y-axis, inside the blue 4-by-4 box centered on the origin, or outside of the box.
ja: このswitch文は、そのポイントがあるのは、原点(0, 0)、赤いx-軸上、オレンジのy-軸上、原点を中心とした青の４×４の四角の内側、または四角の外側かどうかを決定します。

source: The switch statement determines whether the point is on the green diagonal line where x == y, on the purple diagonal line where x == -y, or neither.
ja: このswitch文は、そのポイントが、x == yであるところの緑の斜線上、あるいはx == -yであるところの紫の斜線上にあるかどうかを決定します。

source: The switch statement determines whether the point is on the red x-axis, on the orange y-axis, or elsewhere (on neither axis).
ja: このswitch文は、この地点が、赤のx-軸上、オレンジのy-軸上、または他のどこか（どちらの軸上でもない）かを決定します。

source: The switch statement’s first case matches all five lowercase vowels in the English language.
ja: switch文の最初のケース節は、英語における５つの小文字の母音字すべてにマッチします。

source: The switch statement’s first case matches the first letter of the English alphabet, a, and its second case matches the last letter, z.
ja: switch文の最初のケース節は、英語アルファペットの最初の文字、aにマッチします、そしてそれの２番目のケース節は最後の文字、zにマッチします。

source: The targetEnvironment() platform condition returns true when code is compiled for a simulator; otherwise, it returns false.
ja: targetEnvironment()プラットホーム条件は、コードがシミュレータに対してコンパイルされる場合はtrueを返します、そうでなければ、それはfalseを返します。

source: The things array contains two Int values, two Double values, a String value, a tuple of type (Double, Double), the movie “Ghostbusters”, and a closure expression that takes a String value and returns another String value.
ja: things配列は、２つのInt値、２つのDouble値、１つのString値、型(Double, Double)のタプル、映画「ゴーストバスターズ」、そしてString値をとって別のString値を返す１つのクロージャ式を含みます。

source: The throws keyword is part of a function’s type, and nonthrowing functions are subtypes of throwing functions.
ja: throwsキーワードは関数の型の一部です、そしてスローを行わない関数はスロー関数の下位型です。

source: The toggle() method is marked with the mutating keyword as part of the Togglable protocol definition, to indicate that the method is expected to mutate the state of a conforming instance when it’s called:
ja: toggle()メソッドは、Togglableプロトコル定義の一部としてmutatingキーワードで印されます、それによってそのメソッドが、それが呼ばれるとき準拠インスタンスの状態を変化させることを予期されるようにします：

source: The topItem computed property can now be used with any Stack instance to access and query its top item without removing it.
ja: topItem計算プロパティは、今やあらゆるStackインスタンスで、それの一番上の項目にそれを取り除くことなくアクセスおよび問い合わせるために使われることができます。

source: The topItem property returns an optional value of type Element.
ja: topItemプロパティは型Elementのオプショナルの値を返します。

source: The try? expression doesn’t introduce an extra level of optionality to expressions that already return optionals.
ja: try?式は、既にオプショナルを返す式に、余分な水準の随意性を導入しません。

source: The unavailable argument indicates that the declaration isn’t available on the specified platform.
ja: unavailable引数は、その宣言が指定されたプラットホーム上で利用可能でないことを指し示します。

source: The updateValue(_:forKey:) method returns an optional value of the dictionary’s value type.
ja: updateValue(_:forKey:)メソッドは、その辞書の値型のオプショナルの値を返します。

source: The userDefinedColorName variable is defined as an optional String, with a default value of nil.
ja: userDefinedColorName変数は、省略時の値のnilを持つ、あるオプショナルのStringとして定義されます。

source: The value properties for the first three UnicodeScalar values (68, 111, 103) once again represent the characters D, o, and g.
ja: 最初の３つのUnicodeScalar値（68、111、103）のためのvalueプロパティは、またふたたび文字D、o、そしてgを表します。

source: The value property of the fifth and final UnicodeScalar, 128054, is a decimal equivalent of the hexadecimal value 1F436, which represents the Unicode scalar U+1F436 for the DOG FACE character.
ja: ５番目で最後のUnicodeScalarのvalueプロパティ、128054は、16進の値1F436の10進の等価物です、そしてそれは、DOG FACE文字のためのユニコード・スカラーU+1F436を表わします。

source: The welcomeMessage variable can now be set to any string value without error:
ja: welcomeMessage変数は、現在エラーなしでどんな文字列値にでも設定されることができます：

source: The while loop’s condition is while square != finalSquare, to reflect that you must land exactly on square 25.
ja: whileループの条件は、あなたが正確に正方形25に到着しなければならないことを反映する、while square != finalSquareです。

source: The willSet and didSet observers for totalSteps are called whenever the property is assigned a new value.
ja: totalStepsのためのwillSetとdidSetオブザーバーは、プロパティが新しい値を代入されるときはいつでも呼ばれます。

source: The willSet and didSet observers of superclass properties are called when a property is set in a subclass initializer, after the superclass initializer has been called.
ja: スーパークラスプロパティのwillSetとdidSetオブザーバーは、スーパークラスイニシャライザが呼び出され終わった後、あるプロパティがサプクラスのイニシャライザにおいて設定される時に呼び出されます。

source: The willSet and didSet observers provide a way to observe (and to respond appropriately) when the value of a variable or property is being set.
ja: willSetとdidSetオブザーバーは、変数またはプロパティの値が設定されている時に監視する（そして適切に応答する）方法を提供します。

source: The wiseWords constant contains two escaped double quotation marks.
ja: 定数のwiseWordsは、２つのエスケープされた二重引用符文字を含みます。

source: The Car class also overrides the description property it inherits from Vehicle, to provide a custom description that includes the current gear:
ja: Carクラスはまた、それがVehicleから継承するdescriptionプロパティをオーバーライドして、現在のギアーを示すあつらえの説明を提供します：

source: The apartment property is optional, because a person may not always have an apartment.
ja: 人は必ずしもアパートを持つわけではないので、apartmentプロパティはオプショナルです。

source: The makeIncrementer function defines a nested function called incrementer, which performs the actual incrementing.
ja: makeIncrementer関数はincrementerと呼ばれる入れ子にされた関数を定義します、それは、実際に増やすことを実行します。

source: The switch case matches the current value of point only if the where clause’s condition evaluates to true for that value.
ja: このswitchケース節は、pointの現在の値に、where節の条件がtrueに評価する場合にのみ適合します。

source: The fixedIncrement property is also an optional requirement, so its value is an optional Int value, even though fixedIncrement is defined as a non-optional Int property as part of the CounterDataSource protocol definition.
ja: fixedIncrementプロパティもまたオプショナルの要件です、なのでその値はオプショナルのInt値です、たとえfixedIncrementが非オプショナルのIntプロパティであるとCounterDataSourceプロトコル定義の部分では定義されるとしてもです。

source: The description property uses optional binding to check whether there is a second value to display, and if so, inserts additional description detail for that second value.
ja: descriptionプロパティは、オプショナル束縛を使って、表示する第２の値があるかどうか調べます、そしてもしそうなら、その第２の値に関する追加の記述詳細を差し込みます。

source: The Country initializer can therefore pass self as one of the parameters for the City initializer when the Country initializer is setting its own capitalCity property.
ja: Countryイニシャライザはしたがって、selfをCityイニシャライザのパラメータの１つとして渡すことが、Countryイニシャライザが自身のcapitalCityプロパティを設定しているときに可能です。

source: The default case adds some extra text to the end of the description, and the switch statement is complete.
ja: defaultケース節はこの解説（description）の終わりに追加の若干のテキストを加えます、そしてswitch文は終了します。

source: The continue gameLoop statement ends the current while loop iteration and begins the next iteration of the loop.
ja: continue gameLoop文は、現在のwhileループ繰り返しを終えて、ループの次の繰り返しを開始します。

source: The name property is automatically given a default value of nil, or “no name value”, because it’s of an optional type.
ja: nameプロパティは省略時の値のnil、つまり「name値なし」を自動的に与えられます、なぜならそれがオプショナル型であるからです。

source: The COMBINING ACUTE ACCENT scalar is graphically applied to the scalar that precedes it, turning an e into an é when it’s rendered by a Unicode-aware text-rendering system.
ja: COMBINING ACUTE ACCENTスカラーは、それの前のスカラーに追加筆記され、eを、それがユニコードに通じたテキスト描画システムによって表わされる時に、éにします。

source: The BlackjackCard structure contains two nested enumeration types called Suit and Rank.
ja: BlackjackCard構造体は、SuitとRankと呼ばれる２つの入れ子にされた列挙型を含みます。

source: The Celsius structure implements two custom initializers called init(fromFahrenheit:) and init(fromKelvin:), which initialize a new instance of the structure with a value from a different temperature scale:
ja: Celsius構造体は、init(fromFahrenheit:)とinit(fromKelvin:)と呼ばれる２つのあつらえのイニシャライザを実装します、それは、その構造体の新しいインスタンスを異なる温度尺度の値を使って初期化します：

source: The Container protocol needs to specify that any value passed to the append(_:) method must have the same type as the container’s element type, and that the value returned by the container’s subscript will be of the same type as the container’s element type.
ja: Containerプロトコルは、append(_:)メソッドに渡されるあらゆる値がそのコンテナの要素の型と同じ型を持たなければならないこと、そしてコンテナの添え字によって返される値がコンテナの要素型と同じ型のものになることを指定する必要があります。

source: The Fahrenheit structure has one stored property, temperature, which is of type Double:
ja: Fahrenheit構造体は、１つの格納プロパティ、temperatureを持ちます、それはDouble型です：

source: The Food class introduces a single String property called name and provides two initializers for creating Food instances:
ja: Foodクラスは、nameと呼ばれる１つのStringプロパティを導入して、２つのイニシャライザをFoodインスタンスをつくるために提供します：

source: The Point example shown above could have been written in the following way instead:
ja: 上で示されるPointの例は、その代わりに以下のようにして書かれることができます：

source: The anotherGreeting(for:) function returns the same greeting message, using the return keyword like a longer function.
ja: anotherGreeting(for:)関数は、同じ挨拶メッセージを返します、もっと長い関数のようにreturnキーワードを使って。

source: The break statement can be used inside a switch or loop statement when you want to terminate the execution of the switch or loop statement earlier than would otherwise be the case.
ja: break文は、これを使わなかった場合よりも早くswitchまたはループ文の実行をあなたが終了したい時に、switchやループ文の内側で使われることができます。

source: The dollarSign, blackHeart, and sparklingHeart constants demonstrate the Unicode scalar format:
ja: dollarSign、blackHeart、そしてsparklingHeart定数は、Unicodeスカラーの書式を示します：
